//*****************************//
//   ファイル名 :Ex1_6.java    //
//   課題番号   :1_6           //
//   作成者     :大友          //
//   番号       :8             //
//   日付       :2020-10-12     //
//*****************************//
class Ex1_6
{
	public static void main(String[] args){
		String [] dt1={"東京都","埼玉県","千葉県"};
		String [][] dt2={{"板橋区","北区","豊島区","練馬区","中野区","新宿区","中央区"},{"朝霞市","草加市","所沢市","さいたま市"},{"我孫子市","浦安市"}};
			
		for(int i=0; i<dt1.length; i++){
			System.out.print(dt1[i]+"の住所は");
			for(int j=0; j<dt2[i].length; j++){
				System.out.printf("  %s",dt2[i][j]);
			}
			System.out.println();
		}	
	}	
}

/*実行結果
東京都の住所は  板橋区  北区  豊島区  練馬区  中野区  新宿区  中央区
埼玉県の住所は  朝霞市  草加市  所沢市  さいたま市
千葉県の住所は  我孫子市  浦安市

*/